try:
    week = int(input("Введіть номер тижня (1 або 2): "))
    day = int(input("Введіть номер дня тижня (1-5): "))
except KeyError:
    print("Некоректний тиждень або день.")

schedule = {
    1: { # 1 тиждень
        1: "Математика, Програмування",
        2: "Фізика, Англійська мова",
        3: "Українська мова, Історія",
        4: "Фізкультура, Бази даних",
        5: "Веб-дизайн"
    },
    2: { # 2 тиждень
        1: "Алгоритми, Математика",
        2: "Економіка, Право",
        3: "Програмування (практика)",
        4: "Психологія",
        5: "Кураторська година"
    }
}


    print(f"Ваш розклад: {schedule[week][day]}")
